crazyjay97/esp_lr2021_radio/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# LR2021 radio driver (esp_lora_driver)
CONFIG_SMTC_RADIO_LR20XX=y
CONFIG_LIERDA_BOARD_LRMAM36_FANN4=y
CONFIG_SMTC_RAC_LOG_MINIMAL=y

# Keep app logs on the native USB-Serial/JTAG port used by idf.py monitor.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set

# Keep CPU at 160 MHz. 240 MHz has been observed to corrupt SP0A39 DVP
# color capture, likely through tighter PSRAM/cache/GDMA timing margin.
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80 is not set
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240 is not set
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160

# Diagnostic task/core load counters (ESP timer, 1 MHz).
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

CONFIG_CAM_CTRL_DVP_ENABLE=y
CONFIG_CAM_CTRL_DVP_DMA_BUFFER_SIZE=32768
CONFIG_CAM_CTRL_DVP_TASK_STACK_SIZE=4096
# CONFIG_CAM_CTRL_DVP_LOG_ENABLE is not set
CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE=y
# CONFIG_ESP_VIDEO_ENABLE_USB_UVC_VIDEO_DEVICE is not set

CONFIG_CAMERA_SP0A39=y
CONFIG_CAMERA_SP0A39_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# CONFIG_CAMERA_SP0A39_AUTO_DETECT_SPI_INTERFACE_SENSOR is not set
CONFIG_CAMERA_SP0A39_DVP_GRAY_640X480_30FPS=y
CONFIG_CAMERA_SP0A39_DVP_DEFAULT_FMT_GRAY_640X480_30FPS=y
# ESP32-S3R8 has in-package 8MB Octal PSRAM.
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
# CONFIG_SPIRAM_MODE_QUAD is not set
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_SPEED=40
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
